Revit 2024 API
BasicFileInfo.IsCentral Property
 Checks if the file is workshared and Central.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public bool IsCentral { get; }
Visual Basic
Public ReadOnly Property IsCentral As Boolean
	Get
Visual C++
public:
property bool IsCentral {
	bool get ();
}
See Also
BasicFileInfo Class
Autodesk.Revit.DB Namespace